<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"535a7753102d622bb11d059e8fb14f9732316f172ec7fcf8907907edf87c14d4","plan_job_ref":"Job Terraform Plan #113 at https://github.com/ironashram/kub1k/actions/runs/12524647311","plan_out_hash":"13ddc597d632fc4c9d3502dec620050b49824adcb3e61aab1932d87c455da6eb","plan_hash":"e146190a9adc4b5f8dd9c26911ef4b0e94c9834e05a7dd4a0e05feabc8af23a2","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_apps[0].helm_release.argocd will be updated in-place
!~  resource "helm_release" "argocd" {
        id                         = "argocd"
        name                       = "argocd"
!~      version                    = "7.7.10" -> "7.7.11"
#        (27 unchanged attributes hidden)

#        (6 unchanged blocks hidden)
    }

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "timestamp" = "2024-12-23T10:45:52Z" -> (known after apply)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #113](https://github.com/ironashram/kub1k/actions/runs/12524647311)